[
{"joke_text": "Steve Martin is one of the finest gentlemen you'll ever meet. For him to be attacked because he said, \"When he met Carrie Fisher he thought she was the most beautiful creature he had ever see... "},
{"joke_text": "Jokes are funny things. When they first appear they amuse or shock, and eventually they tire.The Washington Post recently resurrected and rejuvenated an old joke. It goes like this: “How ca... "},
{"joke_text": "Way back in 1983 Roy Sekoff, now President and Chief Creative Officer at The Huffington Post, sat down to interview a comedy legend. That legend? None other than Robin Williams. Take a trip down memor... "},
{"joke_text": "Go back to a time that Laugh Factory founder Jamie Masada sat down with Joan Rivers at Spago’s Restaurant in Hollywood. Here's Joan as we remember her -- down to earth and funny. Always funn... "},
{"joke_text": "The Laugh Factory Magazine:\nIs there anything you prefer not to discuss and what would you like to say about it?\n\nSteve Martin:\nI would prefer not discussing the fact that I am shrinking at the rate o... "},
{"joke_text": "Back before he became Bernie and even back before Curb Your Enthusiasm, Larry David was known as the man behind Seinfeld. The Laugh Factory Magazine sat down with him then in an interview that gives y... "},
{"joke_text": "It's strange that a doper comedian like myself is writing about fitness. Most people think that dopers and good health don’t’ go together. It’s like expecting neo-Nazis to drink ... "},
{"joke_text": "Most mornings I buy a box of twelve doughnuts. Come on. It’s fifty cents for one or ninety-nine cents for a dozen. But I don’t merely like doughnuts, I need them. Like a drug addict who wa... "},
{"joke_text": "Black is a very negative thing in America.\n\n \n\nFor Instance, if the stock market was going to crash, they have Black Monday. You hear someone in court say, “It was the darkest day of my lif... "},
{"joke_text": "By the year 2015, the U.S Census states that majority of people in our country will be people of color: Latino, Asian, African-American, etc. This statistic makes the 1992 words of that great philosop... "},
{"joke_text": "If I had to make films without complete control from start to finish, I definitely would not do it. I'm only making films because I'm as free there as if I were writing novels. You can't c... "}
]